-- 基础信息
local base_info = {
	group_id = 133610025
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 25001 , monster_id = 22140101 , pos = { x = 6327.364, y = 239.532, z = 10194.55 } , rot = { x = 0, y = 214.279, z = 0 } , level = 93 , title_id = 4090, special_name_id = 2408901 },
	{ config_id = 25002 , monster_id = 22140101 , pos = { x = 6321.105, y = 237.646, z = 10201.02 } , rot = { x = 0, y = 10.181, z = 0 } , level = 93 , title_id = 4090, special_name_id = 2408901 },
	{ config_id = 25004 , monster_id = 22140101 , pos = { x = 6317.666, y = 237.849, z = 10196.83 } , rot = { x = 0, y = 280.602, z = 0 } , level = 93 , title_id = 4090, special_name_id = 2408901 },
	{ config_id = 25005 , monster_id = 22140101 , pos = { x = 6328.54, y = 238.391, z = 10202.12 } , rot = { x = 0, y = 220.704, z = 0 } , level = 93 , title_id = 4090, special_name_id = 2408901 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 25003 , gadget_id = 70211022 , pos = { x = 6319.353, y = 237.552, z = 10205.32 } , rot = { x = 359.824, y = 159.204, z = 356.921 } , level = 88 },
	{ config_id = 25006 , gadget_id = 42215010 , pos = { x = 6322.727, y = 239.371, z = 10192.56 } , rot = { x = 0, y = 0, z = 0 } , level = 93 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 25001,25002,25004,25005 },
		gadgets = { 25003,25006 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
