-- 基础信息
local base_info = {
	group_id = 133610087
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 87001 , monster_id = 35550504 , pos = { x = 6255.062, y = 229.384, z = 10022.69 } , rot = { x = 0, y = 59.758, z = 0 } , level = 93 , title_id = 7359, special_name_id = 2900101 },
	{ config_id = 87002 , monster_id = 33070102 , pos = { x = 6259.72, y = 230.168, z = 10025.26 } , rot = { x = 0, y = 65.013, z = 0 } , level = 93 , title_id = 7411, special_name_id = 2741101 },
	{ config_id = 87003 , monster_id = 35550506 , pos = { x = 6259.001, y = 229.586, z = 10016.38 } , rot = { x = 0, y = 65.013, z = 0 } , level = 93 , title_id = 7359, special_name_id = 2900101 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 87006 , gadget_id = 73070149 , pos = { x = 6262.857, y = 222.866, z = 10030.54 } , rot = { x = 0, y = 0, z = 0 } , level = 75 },
	{ config_id = 87007 , gadget_id = 73070149 , pos = { x = 6261.88, y = 222.122, z = 10020.43 } , rot = { x = 0, y = 0, z = 0 } , level = 75 },
	{ config_id = 87008 , gadget_id = 73070149 , pos = { x = 6257.72, y = 222, z = 10027.06 } , rot = { x = 0, y = 0, z = 0 } , level = 75 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 87001,87002,87003 },
		gadgets = { 87006,87007,87008 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
