-- 基础信息
local base_info = {
	group_id = 133601332
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 332001 , monster_id = 23072101 , pos = { x = 3328.432, y = 410.994, z = 9877.262 } , rot = { x = 0, y = 294.093, z = 0 } , level = 91 , title_id = 7411, special_name_id = 2741201 },
	{ config_id = 332002 , monster_id = 23074101 , pos = { x = 3320.563, y = 410.973, z = 9882.348 } , rot = { x = 0, y = 190.09, z = 0 } , level = 91 , title_id = 7411, special_name_id = 2741401 },
	{ config_id = 332003 , monster_id = 23070101 , pos = { x = 3319.4, y = 410.973, z = 9877.824 } , rot = { x = 0, y = 13.803, z = 0 } , level = 91 , title_id = 7411, special_name_id = 2741101 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 332004 , gadget_id = 42308099 , pos = { x = 3322.344, y = 411.006, z = 9879.324 } , rot = { x = 0, y = 0, z = 0 } , level = 91 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 332001,332002,332003 },
		gadgets = { 332004 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
