-- 基础信息
local base_info = {
	group_id = 133610077
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 77001 , monster_id = 35550310 , pos = { x = 6182.053, y = 216.639, z = 10062.89 } , rot = { x = 0, y = 0, z = 0 } , level = 93 , title_id = 7359, special_name_id = 2900101 },
	{ config_id = 77002 , monster_id = 35550210 , pos = { x = 6178.026, y = 216.577, z = 10063.51 } , rot = { x = 0, y = 0, z = 0 } , level = 93 , title_id = 7359, special_name_id = 2900101 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 77003 , gadget_id = 73070136 , pos = { x = 6379.51, y = 315.13, z = 9911.58 } , rot = { x = 21.383, y = 307.53, z = 0 } , level = 93 },
	{ config_id = 77004 , gadget_id = 73070137 , pos = { x = 6182.728, y = 217.087, z = 10061.9 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 77008 , gadget_id = 73070034 , pos = { x = 6182.053, y = 216.639, z = 10062.89 } , rot = { x = 0, y = 0, z = 0 } , level = 75 },
	{ config_id = 77010 , gadget_id = 73074075 , pos = { x = 6172.676, y = 225.41, z = 10060.54 } , rot = { x = 0, y = 0, z = 0 } , level = 75 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 77001,77002 },
		gadgets = { 77003,77004,77008,77010 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
