-- 基础信息
local base_info = {
	group_id = 133611001
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 1019 , monster_id = 22050201 , pos = { x = 5631.998, y = 291.742, z = 9927.258 } , rot = { x = 0, y = 256.138, z = 0 } , level = 93 , title_id = 4032, special_name_id = 2403101 },
	{ config_id = 1020 , monster_id = 22050201 , pos = { x = 5629.889, y = 291.742, z = 9923.563 } , rot = { x = 0, y = 314.045, z = 0 } , level = 93 , title_id = 4032, special_name_id = 2403101 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 1021 , gadget_id = 73010027 , pos = { x = 5626.233, y = 292.121, z = 9927.711 } , rot = { x = 0, y = 0, z = 0 } , level = 75 },
	{ config_id = 1022 , gadget_id = 70800673 , pos = { x = 5627.218, y = 292.506, z = 9927.536 } , rot = { x = 0, y = 0, z = 0 } , level = 75 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 1019,1020 },
		gadgets = { 1021,1022 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
