-- 基础信息
local base_info = {
	group_id = 133601333
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 333001 , monster_id = 23073102 , pos = { x = 3376.892, y = 375.931, z = 9959.04 } , rot = { x = 0, y = 239.187, z = 0 } , level = 91 , title_id = 7411, special_name_id = 2741301 },
	{ config_id = 333002 , monster_id = 23073102 , pos = { x = 3385.632, y = 375.931, z = 9963.882 } , rot = { x = 0, y = 150.102, z = 0 } , level = 91 , title_id = 7411, special_name_id = 2741301 },
	{ config_id = 333003 , monster_id = 23070101 , pos = { x = 3367.06, y = 376.103, z = 9972.304 } , rot = { x = 0, y = 101.57, z = 0 } , level = 91 , title_id = 7411, special_name_id = 2741101 },
	{ config_id = 333004 , monster_id = 23074102 , pos = { x = 3366.544, y = 375.931, z = 9988.317 } , rot = { x = 0, y = 150.234, z = 0 } , level = 91 , title_id = 7411, special_name_id = 2741401 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 333009 , gadget_id = 70360001 , pos = { x = 3372.594, y = 372.65, z = 9961.166 } , rot = { x = 0, y = 0, z = 0 } , level = 91 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 333001,333002,333003,333004 },
		gadgets = { 333009 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
