-- 基础信息
local base_info = {
	group_id = 133611324
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 324001 , monster_id = 22040101 , pos = { x = 5287.092, y = 340.365, z = 9485.527 } , rot = { x = 0, y = 356.352, z = 0 } , level = 88 , title_id = 4031, special_name_id = 2403101 },
	{ config_id = 324004 , monster_id = 33070102 , pos = { x = 5285.704, y = 340.297, z = 9487.365 } , rot = { x = 0, y = 0, z = 0 } , level = 88 , title_id = 7411, special_name_id = 2741101 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 324019 , gadget_id = 70801137 , pos = { x = 5290.911, y = 340.742, z = 9490.888 } , rot = { x = 0, y = 356.954, z = 0 } , level = 75 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 324001,324004 },
		gadgets = { 324019 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
