-- 基础信息
local base_info = {
	group_id = 133610012
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 12037 , monster_id = 22130002 , pos = { x = 6305.206, y = 248.765, z = 9974.317 } , rot = { x = 0, y = 0, z = 0 } , level = 93 , title_id = 4087, special_name_id = 2408701 },
	{ config_id = 12038 , monster_id = 22130101 , pos = { x = 6296.706, y = 248.249, z = 9981.876 } , rot = { x = 0, y = 351.705, z = 0 } , level = 93 , title_id = 4087, special_name_id = 2408701 },
	{ config_id = 12041 , monster_id = 22130002 , pos = { x = 6296.87, y = 246.977, z = 9975.364 } , rot = { x = 0, y = 0, z = 0 } , level = 93 , title_id = 4087, special_name_id = 2408701 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 12009 , gadget_id = 73070007 , pos = { x = 6288.221, y = 244.596, z = 9963.945 } , rot = { x = 0, y = 175.338, z = 0 } , level = 93 },
	{ config_id = 12012 , gadget_id = 73070136 , pos = { x = 6379.183, y = 315.807, z = 9911.818 } , rot = { x = 29.544, y = 306.931, z = 0 } , level = 93 },
	{ config_id = 12013 , gadget_id = 73070137 , pos = { x = 6291.827, y = 248.282, z = 9963.592 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 12039 , gadget_id = 73070024 , pos = { x = 6287.87, y = 246.796, z = 9986.785 } , rot = { x = 0, y = 149.748, z = 0 } , level = 93 },
	{ config_id = 12040 , gadget_id = 73070089 , pos = { x = 6304.143, y = 249.146, z = 9977.576 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 12048 , gadget_id = 73070031 , pos = { x = 6291.26, y = 251.857, z = 10006.64 } , rot = { x = 328.877, y = 359.052, z = 26.188 } , level = 93 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 12037,12038,12041 },
		gadgets = { 12009,12012,12013,12039,12040,12048 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
