-- 基础信息
local base_info = {
	group_id = 133601046
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 46004 , monster_id = 23080102 , pos = { x = 3225.487, y = 351.052, z = 9829.986 } , rot = { x = 0, y = 327.984, z = 0 } , level = 91 , title_id = 7421, special_name_id = 2742101 },
	{ config_id = 46005 , monster_id = 23080102 , pos = { x = 3211.702, y = 351.052, z = 9834.967 } , rot = { x = 0, y = 148.79, z = 0 } , level = 91 , title_id = 7421, special_name_id = 2742101 },
	{ config_id = 46006 , monster_id = 23080401 , pos = { x = 3223.039, y = 351.052, z = 9826.918 } , rot = { x = 0, y = 332.315, z = 0 } , level = 91 , title_id = 7421, special_name_id = 2742401 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 46011 , gadget_id = 42308099 , pos = { x = 3220.518, y = 351.126, z = 9834.159 } , rot = { x = 0, y = 0, z = 0 } , level = 91 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 46004,46005,46006 },
		gadgets = { 46011 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
