-- 基础信息
local base_info = {
	group_id = 133610007
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 7001 , monster_id = 22130002 , pos = { x = 6327.387, y = 234.223, z = 10088.96 } , rot = { x = 0, y = 0, z = 0 } , level = 93 , title_id = 4087, special_name_id = 2408701 },
	{ config_id = 7002 , monster_id = 22130001 , pos = { x = 6335.218, y = 235.493, z = 10082.09 } , rot = { x = 0, y = 29.012, z = 0 } , level = 93 , title_id = 4087, special_name_id = 2408701 },
	{ config_id = 7003 , monster_id = 22130101 , pos = { x = 6325.921, y = 233.274, z = 10085.21 } , rot = { x = 0, y = 0, z = 0 } , level = 93 , title_id = 4087, special_name_id = 2408701 },
	{ config_id = 7004 , monster_id = 22130101 , pos = { x = 6329.15, y = 233.111, z = 10076.48 } , rot = { x = 0, y = 314.207, z = 0 } , level = 93 , title_id = 4087, special_name_id = 2408701 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 7005 , gadget_id = 70211012 , pos = { x = 6324.21, y = 235.973, z = 10094.77 } , rot = { x = 0, y = 189, z = 0 } , level = 88 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 7001,7002,7003,7004 },
		gadgets = { 7005 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
