-- 基础信息
local base_info = {
	group_id = 133610092
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 92001 , monster_id = 33070101 , pos = { x = 6144.055, y = 223, z = 9973.988 } , rot = { x = 0, y = 104.26, z = 0 } , level = 93 , title_id = 7411, special_name_id = 2741101 },
	{ config_id = 92002 , monster_id = 35550504 , pos = { x = 6143.59, y = 223, z = 9972.525 } , rot = { x = 0, y = 92.84, z = 0 } , level = 93 , title_id = 7359, special_name_id = 2900101 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 92003 , gadget_id = 73036116 , pos = { x = 6143.313, y = 224.071, z = 9972.557 } , rot = { x = 85.997, y = 260.024, z = 342.452 } , level = 75 },
	{ config_id = 92004 , gadget_id = 73070105 , pos = { x = 6144.398, y = 223, z = 9972.829 } , rot = { x = 0, y = 0, z = 0 } , level = 75 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 92001,92002 },
		gadgets = { 92003,92004 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
