-- 基础信息
local base_info = {
	group_id = 133610109
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 109008 , monster_id = 35550506 , pos = { x = 6324.466, y = 232.514, z = 10087.86 } , rot = { x = 0, y = 0, z = 0 } , level = 93 , title_id = 7359, special_name_id = 2900101 },
	{ config_id = 109009 , monster_id = 35550210 , pos = { x = 6324.488, y = 231.907, z = 10081.12 } , rot = { x = 0, y = 0, z = 0 } , level = 93 , title_id = 7359, special_name_id = 2900101 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 109001 , gadget_id = 70290196 , pos = { x = 6321.875, y = 240.641, z = 10041.93 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 109011 , gadget_id = 73070149 , pos = { x = 6320.528, y = 223.198, z = 10088.02 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 109012 , gadget_id = 73070149 , pos = { x = 6322.521, y = 223.297, z = 10084.71 } , rot = { x = 0, y = 0, z = 0 } , level = 93 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 109008,109009 },
		gadgets = { 109001,109011,109012 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
