-- 基础信息
local base_info = {
	group_id = 133611290
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 290014 , monster_id = 22040101 , pos = { x = 5250.683, y = 341.687, z = 9474.075 } , rot = { x = 0, y = 341.267, z = 0 } , level = 93 , title_id = 4031, special_name_id = 2403101 },
	{ config_id = 290024 , monster_id = 35550210 , pos = { x = 5253.443, y = 341.004, z = 9480.74 } , rot = { x = 0, y = 0, z = 0 } , level = 93 , title_id = 7359, special_name_id = 2900101 },
	{ config_id = 290025 , monster_id = 35550311 , pos = { x = 5250.788, y = 340.968, z = 9477.045 } , rot = { x = 0, y = 188.596, z = 0 } , level = 93 , title_id = 7359, special_name_id = 2900101 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {

}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 290014,290024,290025 },
		gadgets = {  },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
