-- 基础信息
local base_info = {
	group_id = 133601337
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 337001 , monster_id = 23078101 , pos = { x = 3261.711, y = 410.836, z = 9953.493 } , rot = { x = 0, y = 358.938, z = 0 } , level = 91 , title_id = 7411, special_name_id = 2741601 },
	{ config_id = 337002 , monster_id = 23076102 , pos = { x = 3262.957, y = 410.816, z = 9952.57 } , rot = { x = 0, y = 325.239, z = 0 } , level = 91 , title_id = 7411, special_name_id = 2741501 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 337003 , gadget_id = 42308099 , pos = { x = 3262.701, y = 410.857, z = 9951.027 } , rot = { x = 0, y = 0, z = 0 } , level = 91 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 337001,337002 },
		gadgets = { 337003 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
