-- 基础信息
local base_info = {
	group_id = 133601336
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 336001 , monster_id = 23073102 , pos = { x = 3234.815, y = 411.045, z = 9845.97 } , rot = { x = 0, y = 20.673, z = 0 } , level = 91 , title_id = 7411, special_name_id = 2741301 },
	{ config_id = 336002 , monster_id = 23073102 , pos = { x = 3229.155, y = 411.111, z = 9850.29 } , rot = { x = 0, y = 43.194, z = 0 } , level = 91 , title_id = 7411, special_name_id = 2741301 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 336003 , gadget_id = 42308099 , pos = { x = 3231.203, y = 411.136, z = 9844.107 } , rot = { x = 0, y = 0, z = 0 } , level = 91 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 336001,336002 },
		gadgets = { 336003 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
