-- 基础信息
local base_info = {
	group_id = 133601294
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 294001 , monster_id = 23080501 , pos = { x = 3434.811, y = 265.955, z = 9493.32 } , rot = { x = 0, y = 240.637, z = 0 } , level = 91 , title_id = 7421, special_name_id = 2742501 },
	{ config_id = 294002 , monster_id = 23080501 , pos = { x = 3436.772, y = 265.97, z = 9489.843 } , rot = { x = 0, y = 240.637, z = 0 } , level = 91 , title_id = 7421, special_name_id = 2742501 },
	{ config_id = 294003 , monster_id = 23075101 , pos = { x = 3435.881, y = 265.97, z = 9490.46 } , rot = { x = 0, y = 121.611, z = 0 } , level = 91 , title_id = 7411, special_name_id = 2741401 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 294004 , gadget_id = 42308099 , pos = { x = 3433.063, y = 264.669, z = 9490.333 } , rot = { x = 0, y = 0, z = 0 } , level = 91 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 294001,294002,294003 },
		gadgets = { 294004 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
