-- 基础信息
local base_info = {
	group_id = 133610041
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 41001 , monster_id = 22140103 , pos = { x = 6406.911, y = -261.523, z = 9911.214 } , rot = { x = 0, y = 212.455, z = 0 } , level = 93 , title_id = 4090, special_name_id = 2408901 },
	{ config_id = 41002 , monster_id = 22140103 , pos = { x = 6404.388, y = -261.277, z = 9908.948 } , rot = { x = 0, y = 267.117, z = 0 } , level = 93 , title_id = 4090, special_name_id = 2408901 },
	{ config_id = 41004 , monster_id = 22140103 , pos = { x = 6403.956, y = -261.058, z = 9916.905 } , rot = { x = 0, y = 267.117, z = 0 } , level = 93 , title_id = 4090, special_name_id = 2408901 },
	{ config_id = 41005 , monster_id = 22140103 , pos = { x = 6407.284, y = -261.255, z = 9915.479 } , rot = { x = 0, y = 212.455, z = 0 } , level = 93 , title_id = 4090, special_name_id = 2408901 },
	{ config_id = 41007 , monster_id = 22140103 , pos = { x = 6406.802, y = -261.213, z = 9916.399 } , rot = { x = 0, y = 212.455, z = 0 } , level = 93 , title_id = 4090, special_name_id = 2408901 },
	{ config_id = 41008 , monster_id = 22140103 , pos = { x = 6401.385, y = -261.234, z = 9913.236 } , rot = { x = 0, y = 212.455, z = 0 } , level = 93 , title_id = 4090, special_name_id = 2408901 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 41011 , gadget_id = 42215010 , pos = { x = 6403.956, y = -261.058, z = 9916.905 } , rot = { x = 0, y = 0, z = 0 } , level = 75 },
	{ config_id = 41012 , gadget_id = 73070039 , pos = { x = 6433.812, y = -259.46, z = 9925.262 } , rot = { x = 0, y = 233.605, z = 0 } , level = 75 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 41001,41002,41004,41005,41007,41008 },
		gadgets = { 41011,41012 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
