-- 基础信息
local base_info = {
	group_id = 133610002
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {

}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 2005 , gadget_id = 73070039 , pos = { x = 6179.28, y = 217.241, z = 10056.56 } , rot = { x = 0, y = 314.237, z = 0 } , level = 93 },
	{ config_id = 2007 , gadget_id = 73070038 , pos = { x = 6169.57, y = 215.6, z = 10058.77 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 2008 , gadget_id = 73070043 , pos = { x = 6178.106, y = 216.5, z = 10059.66 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 2009 , gadget_id = 73070043 , pos = { x = 6176.113, y = 216.5, z = 10059.18 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 2010 , gadget_id = 73070043 , pos = { x = 6174.79, y = 216.5, z = 10057.2 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 2011 , gadget_id = 73070043 , pos = { x = 6177.15, y = 216.5, z = 10059.86 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 2012 , gadget_id = 73070043 , pos = { x = 6174.942, y = 216.5, z = 10058.22 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 2013 , gadget_id = 73070043 , pos = { x = 6175.612, y = 216.5, z = 10058.95 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 2014 , gadget_id = 73036086 , pos = { x = 6170.977, y = 217.255, z = 10064 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 2023 , gadget_id = 73070043 , pos = { x = 6177.442, y = 216.5, z = 10059.97 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 2024 , gadget_id = 73070043 , pos = { x = 6174.125, y = 216.5, z = 10056.37 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 2025 , gadget_id = 73070043 , pos = { x = 6172.897, y = 216.5, z = 10053.09 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 2026 , gadget_id = 73070043 , pos = { x = 6176.058, y = 216.5, z = 10058.22 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 2027 , gadget_id = 73070043 , pos = { x = 6181.205, y = 216.5, z = 10061.02 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 2028 , gadget_id = 73070042 , pos = { x = 6170.704, y = 216.7, z = 10064.12 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 2032 , gadget_id = 73070042 , pos = { x = 6174.742, y = 216.5, z = 10083.75 } , rot = { x = 0, y = 223.915, z = 0 } , level = 93 },
	{ config_id = 2033 , gadget_id = 73070042 , pos = { x = 6176.183, y = 216.5, z = 10082.36 } , rot = { x = 0, y = 223.915, z = 0 } , level = 93 },
	{ config_id = 2034 , gadget_id = 73070042 , pos = { x = 6177.624, y = 216.5, z = 10080.98 } , rot = { x = 0, y = 223.915, z = 0 } , level = 93 },
	{ config_id = 2035 , gadget_id = 73070042 , pos = { x = 6179.064, y = 216.5, z = 10079.59 } , rot = { x = 0, y = 223.915, z = 0 } , level = 93 },
	{ config_id = 2036 , gadget_id = 73070042 , pos = { x = 6158.281, y = 216.5, z = 10055.12 } , rot = { x = 0, y = 43.914, z = 0 } , level = 93 },
	{ config_id = 2037 , gadget_id = 73070042 , pos = { x = 6159.723, y = 216.5, z = 10053.73 } , rot = { x = 0, y = 43.914, z = 0 } , level = 93 },
	{ config_id = 2038 , gadget_id = 73070042 , pos = { x = 6161.163, y = 216.5, z = 10052.35 } , rot = { x = 0, y = 43.914, z = 0 } , level = 93 },
	{ config_id = 2039 , gadget_id = 73070042 , pos = { x = 6162.605, y = 216.5, z = 10050.96 } , rot = { x = 0, y = 43.914, z = 0 } , level = 93 },
	{ config_id = 2040 , gadget_id = 73070042 , pos = { x = 6186.268, y = 216.5, z = 10072.65 } , rot = { x = 0, y = 223.915, z = 0 } , level = 93 },
	{ config_id = 2041 , gadget_id = 73070042 , pos = { x = 6187.709, y = 216.5, z = 10071.26 } , rot = { x = 0, y = 223.915, z = 0 } , level = 93 },
	{ config_id = 2042 , gadget_id = 73070042 , pos = { x = 6189.149, y = 216.5, z = 10069.88 } , rot = { x = 0, y = 223.915, z = 0 } , level = 93 },
	{ config_id = 2043 , gadget_id = 73070042 , pos = { x = 6190.59, y = 216.5, z = 10068.49 } , rot = { x = 0, y = 223.915, z = 0 } , level = 93 },
	{ config_id = 2044 , gadget_id = 73070052 , pos = { x = 6168.549, y = 215.6, z = 10060.75 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 2048 , gadget_id = 73070042 , pos = { x = 6178.197, y = 216.5, z = 10057.05 } , rot = { x = 0, y = 255.976, z = 0 } , level = 93 },
	{ config_id = 2049 , gadget_id = 73070042 , pos = { x = 6178.197, y = 216.5, z = 10057.05 } , rot = { x = 0, y = 268.602, z = 0 } , level = 93 },
	{ config_id = 2050 , gadget_id = 73070042 , pos = { x = 6178.197, y = 216.5, z = 10057.05 } , rot = { x = 0, y = 283.602, z = 0 } , level = 93 },
	{ config_id = 2051 , gadget_id = 73070042 , pos = { x = 6178.197, y = 216.5, z = 10057.05 } , rot = { x = 0, y = 298.602, z = 0 } , level = 93 },
	{ config_id = 2052 , gadget_id = 73070042 , pos = { x = 6178.197, y = 216.5, z = 10057.05 } , rot = { x = 0, y = 313.602, z = 0 } , level = 93 },
	{ config_id = 2053 , gadget_id = 73070042 , pos = { x = 6178.197, y = 216.5, z = 10057.05 } , rot = { x = 0, y = 328.602, z = 0 } , level = 93 },
	{ config_id = 2054 , gadget_id = 73070042 , pos = { x = 6178.197, y = 216.5, z = 10057.05 } , rot = { x = 0, y = 343.602, z = 0 } , level = 93 },
	{ config_id = 2055 , gadget_id = 73070042 , pos = { x = 6178.197, y = 216.5, z = 10057.05 } , rot = { x = 0, y = 358.602, z = 0 } , level = 93 },
	{ config_id = 2056 , gadget_id = 73070042 , pos = { x = 6178.197, y = 216.5, z = 10057.05 } , rot = { x = 0, y = 13.602, z = 0 } , level = 93 },
	{ config_id = 2057 , gadget_id = 73070042 , pos = { x = 6178.197, y = 216.5, z = 10057.05 } , rot = { x = 0, y = 251.025, z = 0 } , level = 93 },
	{ config_id = 2058 , gadget_id = 73070042 , pos = { x = 6178.197, y = 216.5, z = 10057.05 } , rot = { x = 0, y = 263.65, z = 0 } , level = 93 },
	{ config_id = 2059 , gadget_id = 73070042 , pos = { x = 6178.197, y = 216.5, z = 10057.05 } , rot = { x = 0, y = 278.65, z = 0 } , level = 93 },
	{ config_id = 2060 , gadget_id = 73070042 , pos = { x = 6178.197, y = 216.5, z = 10057.05 } , rot = { x = 0, y = 293.651, z = 0 } , level = 93 },
	{ config_id = 2061 , gadget_id = 73070042 , pos = { x = 6178.197, y = 216.5, z = 10057.05 } , rot = { x = 0, y = 308.651, z = 0 } , level = 93 },
	{ config_id = 2062 , gadget_id = 73070042 , pos = { x = 6178.197, y = 216.5, z = 10057.05 } , rot = { x = 0, y = 323.651, z = 0 } , level = 93 },
	{ config_id = 2063 , gadget_id = 73070042 , pos = { x = 6178.197, y = 216.5, z = 10057.05 } , rot = { x = 0, y = 338.651, z = 0 } , level = 93 },
	{ config_id = 2064 , gadget_id = 73070042 , pos = { x = 6178.197, y = 216.5, z = 10057.05 } , rot = { x = 0, y = 353.651, z = 0 } , level = 93 },
	{ config_id = 2065 , gadget_id = 73070042 , pos = { x = 6178.197, y = 216.5, z = 10057.05 } , rot = { x = 0, y = 8.651, z = 0 } , level = 93 },
	{ config_id = 2067 , gadget_id = 73070042 , pos = { x = 6170.069, y = 216.5, z = 10065.14 } , rot = { x = 0, y = 284.281, z = 0 } , level = 93 },
	{ config_id = 2068 , gadget_id = 73070042 , pos = { x = 6170.069, y = 216.5, z = 10065.14 } , rot = { x = 0, y = 314.281, z = 0 } , level = 93 },
	{ config_id = 2069 , gadget_id = 73070042 , pos = { x = 6170.069, y = 216.5, z = 10065.14 } , rot = { x = 0, y = 344.281, z = 0 } , level = 93 },
	{ config_id = 2070 , gadget_id = 73070042 , pos = { x = 6170.069, y = 216.5, z = 10065.14 } , rot = { x = 0, y = 14.28, z = 0 } , level = 93 },
	{ config_id = 2071 , gadget_id = 73070042 , pos = { x = 6170.069, y = 216.5, z = 10065.14 } , rot = { x = 0, y = 44.28, z = 0 } , level = 93 },
	{ config_id = 2072 , gadget_id = 73070042 , pos = { x = 6170.069, y = 216.5, z = 10065.14 } , rot = { x = 0, y = 74.28, z = 0 } , level = 93 },
	{ config_id = 2073 , gadget_id = 73070042 , pos = { x = 6170.069, y = 216.5, z = 10065.14 } , rot = { x = 0, y = 104.281, z = 0 } , level = 93 },
	{ config_id = 2074 , gadget_id = 73070042 , pos = { x = 6170.069, y = 216.5, z = 10065.14 } , rot = { x = 0, y = 134.281, z = 0 } , level = 93 },
	{ config_id = 2075 , gadget_id = 73070042 , pos = { x = 6170.069, y = 216.5, z = 10065.14 } , rot = { x = 0, y = 164.281, z = 0 } , level = 93 },
	{ config_id = 2076 , gadget_id = 73070042 , pos = { x = 6170.069, y = 216.5, z = 10065.14 } , rot = { x = 0, y = 194.281, z = 0 } , level = 93 },
	{ config_id = 2077 , gadget_id = 73070044 , pos = { x = 6187.157, y = 216.3, z = 10063.14 } , rot = { x = 0, y = 315, z = 0 } , level = 93 },
	{ config_id = 2078 , gadget_id = 73070044 , pos = { x = 6172.608, y = 216.3, z = 10046.58 } , rot = { x = 0, y = 315, z = 0 } , level = 93 },
	{ config_id = 2079 , gadget_id = 73070044 , pos = { x = 6186.462, y = 216.3, z = 10073.37 } , rot = { x = 0, y = 225, z = 0 } , level = 93 },
	{ config_id = 2080 , gadget_id = 73070044 , pos = { x = 6177.324, y = 216.3, z = 10083.1 } , rot = { x = 0, y = 225, z = 0 } , level = 93 },
	{ config_id = 2081 , gadget_id = 73070044 , pos = { x = 6183.612, y = 216.3, z = 10076.28 } , rot = { x = 0, y = 224.037, z = 0 } , level = 93 },
	{ config_id = 2082 , gadget_id = 73070044 , pos = { x = 6162.139, y = 216.3, z = 10072.89 } , rot = { x = 0, y = 134.038, z = 0 } , level = 93 },
	{ config_id = 2083 , gadget_id = 73070044 , pos = { x = 6188.645, y = 216.3, z = 10071.41 } , rot = { x = 0, y = 224.037, z = 0 } , level = 93 },
	{ config_id = 2084 , gadget_id = 73070044 , pos = { x = 6169.09, y = 216.3, z = 10080.08 } , rot = { x = 0, y = 134.038, z = 0 } , level = 93 },
	{ config_id = 2085 , gadget_id = 73070044 , pos = { x = 6153.694, y = 216.3, z = 10058.03 } , rot = { x = 0, y = 44.037, z = 0 } , level = 93 },
	{ config_id = 2086 , gadget_id = 73070044 , pos = { x = 6172.378, y = 216.3, z = 10048.64 } , rot = { x = 0, y = 314.038, z = 0 } , level = 93 },
	{ config_id = 2087 , gadget_id = 73070044 , pos = { x = 6177.533, y = 216.3, z = 10058.69 } , rot = { x = 0, y = 282.227, z = 0 } , level = 93 },
	{ config_id = 2088 , gadget_id = 73070044 , pos = { x = 6176.31, y = 216.3, z = 10054.22 } , rot = { x = 0, y = 270.831, z = 0 } , level = 93 },
	{ config_id = 2089 , gadget_id = 73070044 , pos = { x = 6181.706, y = 216.3, z = 10060.8 } , rot = { x = 0, y = 294.915, z = 0 } , level = 93 },
	{ config_id = 2090 , gadget_id = 73070044 , pos = { x = 6177.533, y = 216.3, z = 10058.69 } , rot = { x = 0.123, y = 333.734, z = 1.246 } , level = 93 },
	{ config_id = 2091 , gadget_id = 73070044 , pos = { x = 6176.31, y = 216.3, z = 10054.22 } , rot = { x = 0.367, y = 322.341, z = 1.197 } , level = 93 },
	{ config_id = 2092 , gadget_id = 73070044 , pos = { x = 6181.706, y = 216.3, z = 10060.8 } , rot = { x = 359.846, y = 346.419, z = 1.243 } , level = 93 },
	{ config_id = 2095 , gadget_id = 73070042 , pos = { x = 6170.069, y = 216.5, z = 10065.14 } , rot = { x = 0, y = 224.281, z = 0 } , level = 93 },
	{ config_id = 2096 , gadget_id = 73070042 , pos = { x = 6170.069, y = 216.5, z = 10065.14 } , rot = { x = 0, y = 254.281, z = 0 } , level = 93 },
	{ config_id = 2099 , gadget_id = 73070038 , pos = { x = 6169.57, y = 215.6, z = 10058.77 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 2101 , gadget_id = 73070043 , pos = { x = 6170.069, y = 216.5, z = 10065.14 } , rot = { x = 0, y = 254.281, z = 0 } , level = 93 },
	{ config_id = 2102 , gadget_id = 73070043 , pos = { x = 6186.896, y = 216.5, z = 10067.89 } , rot = { x = 0, y = 254.367, z = 0 } , level = 93 },
	{ config_id = 2103 , gadget_id = 73070043 , pos = { x = 6186.003, y = 216.5, z = 10064.5 } , rot = { x = 0, y = 266.632, z = 0 } , level = 93 },
	{ config_id = 2104 , gadget_id = 73070043 , pos = { x = 6184.607, y = 216.5, z = 10061.28 } , rot = { x = 0, y = 280.523, z = 0 } , level = 93 },
	{ config_id = 2105 , gadget_id = 73070043 , pos = { x = 6182.051, y = 216.5, z = 10058.27 } , rot = { x = 0, y = 297.725, z = 0 } , level = 93 },
	{ config_id = 2106 , gadget_id = 73070043 , pos = { x = 6177.797, y = 216.5, z = 10053.39 } , rot = { x = 0, y = 347.439, z = 0 } , level = 93 },
	{ config_id = 2107 , gadget_id = 73070043 , pos = { x = 6175.107, y = 216.5, z = 10051.07 } , rot = { x = 0, y = 355.023, z = 0 } , level = 93 },
	{ config_id = 2108 , gadget_id = 73070043 , pos = { x = 6172.119, y = 216.5, z = 10048.97 } , rot = { x = 0, y = 8.463, z = 0 } , level = 93 },
	{ config_id = 2109 , gadget_id = 73070043 , pos = { x = 6168.229, y = 216.5, z = 10048.46 } , rot = { x = 0, y = 18.986, z = 0 } , level = 93 },
	{ config_id = 2110 , gadget_id = 73070045 , pos = { x = 6172.962, y = 216.7, z = 10048.88 } , rot = { x = 0, y = 358.629, z = 0 } , level = 93 },
	{ config_id = 2111 , gadget_id = 73070045 , pos = { x = 6186.821, y = 216.7, z = 10063.48 } , rot = { x = 0, y = 277.634, z = 0 } , level = 93 },
	{ config_id = 2114 , gadget_id = 73070044 , pos = { x = 6186.874, y = 216.3, z = 10066.29 } , rot = { x = 0, y = 321.73, z = 0 } , level = 93 },
	{ config_id = 2115 , gadget_id = 73070044 , pos = { x = 6184.37, y = 216.3, z = 10063.07 } , rot = { x = 0, y = 276.058, z = 0 } , level = 93 },
	{ config_id = 2116 , gadget_id = 73070044 , pos = { x = 6174.396, y = 216.3, z = 10050.07 } , rot = { x = 0, y = 305.106, z = 0 } , level = 93 },
	{ config_id = 2117 , gadget_id = 73070044 , pos = { x = 6181.358, y = 216.3, z = 10058.5 } , rot = { x = 0, y = 309.819, z = 0 } , level = 93 },
	{ config_id = 2118 , gadget_id = 73070044 , pos = { x = 6171.329, y = 216.3, z = 10049.63 } , rot = { x = 0, y = 329.513, z = 0 } , level = 93 },
	{ config_id = 2119 , gadget_id = 73070044 , pos = { x = 6167.83, y = 216.3, z = 10046.4 } , rot = { x = 0, y = 325.961, z = 0 } , level = 93 },
	{ config_id = 2120 , gadget_id = 73070044 , pos = { x = 6176.346, y = 216.3, z = 10084.07 } , rot = { x = 0, y = 233.014, z = 0 } , level = 93 },
	{ config_id = 2121 , gadget_id = 73070044 , pos = { x = 6187.885, y = 216.3, z = 10069.59 } , rot = { x = 0, y = 243.542, z = 0 } , level = 93 },
	{ config_id = 2122 , gadget_id = 73070044 , pos = { x = 6161.899, y = 216.3, z = 10049.08 } , rot = { x = 0, y = 19.22, z = 0 } , level = 93 },
	{ config_id = 2123 , gadget_id = 73070044 , pos = { x = 6185.669, y = 216.3, z = 10074.7 } , rot = { x = 0, y = 241.182, z = 0 } , level = 93 },
	{ config_id = 2124 , gadget_id = 73070044 , pos = { x = 6176.389, y = 216.3, z = 10052.38 } , rot = { x = 0, y = 325.189, z = 0 } , level = 93 },
	{ config_id = 2125 , gadget_id = 73070044 , pos = { x = 6165.906, y = 216.3, z = 10045.77 } , rot = { x = 0, y = 27.599, z = 0 } , level = 93 },
	{ config_id = 2126 , gadget_id = 73070045 , pos = { x = 6159.662, y = 216.7, z = 10051.61 } , rot = { x = 0, y = 41.473, z = 0 } , level = 93 },
	{ config_id = 2127 , gadget_id = 73070044 , pos = { x = 6172.547, y = 216.3, z = 10045.84 } , rot = { x = 0, y = 298.545, z = 0 } , level = 93 },
	{ config_id = 2128 , gadget_id = 73070044 , pos = { x = 6167.925, y = 216.3, z = 10043.12 } , rot = { x = 0, y = 37.063, z = 0 } , level = 93 },
	{ config_id = 2129 , gadget_id = 73070044 , pos = { x = 6178.716, y = 216.3, z = 10053.87 } , rot = { x = 0, y = 316.619, z = 0 } , level = 93 },
	{ config_id = 2130 , gadget_id = 73070044 , pos = { x = 6181.546, y = 216.3, z = 10056.64 } , rot = { x = 0, y = 323.332, z = 0 } , level = 93 },
	{ config_id = 2131 , gadget_id = 73070044 , pos = { x = 6183.758, y = 216.3, z = 10058.39 } , rot = { x = 0, y = 344.858, z = 0 } , level = 93 },
	{ config_id = 2132 , gadget_id = 73070044 , pos = { x = 6189.776, y = 216.3, z = 10064.11 } , rot = { x = 0, y = 261.012, z = 0 } , level = 93 },
	{ config_id = 2133 , gadget_id = 73070044 , pos = { x = 6189.13, y = 216.3, z = 10070.92 } , rot = { x = 0, y = 252.172, z = 0 } , level = 93 },
	{ config_id = 2134 , gadget_id = 73070044 , pos = { x = 6185.363, y = 216.3, z = 10075.66 } , rot = { x = 0, y = 227.1, z = 0 } , level = 93 },
	{ config_id = 2135 , gadget_id = 73070044 , pos = { x = 6183.1, y = 216.3, z = 10078.16 } , rot = { x = 0, y = 246.463, z = 0 } , level = 93 },
	{ config_id = 2136 , gadget_id = 73070044 , pos = { x = 6174.2, y = 216.3, z = 10085.79 } , rot = { x = 0, y = 209.477, z = 0 } , level = 93 },
	{ config_id = 2137 , gadget_id = 73070044 , pos = { x = 6170.303, y = 216.3, z = 10042.93 } , rot = { x = 0, y = 322.147, z = 0 } , level = 93 },
	{ config_id = 2138 , gadget_id = 73070045 , pos = { x = 6176.867, y = 216.7, z = 10083.79 } , rot = { x = 0, y = 314.711, z = 0 } , level = 93 },
	{ config_id = 2154 , gadget_id = 73070050 , pos = { x = 6152.63, y = 216.3, z = 10063.82 } , rot = { x = 0, y = 44.018, z = 0 } , level = 93 },
	{ config_id = 2155 , gadget_id = 73070050 , pos = { x = 6177.058, y = 216.3, z = 10082.98 } , rot = { x = 0, y = 134.018, z = 0 } , level = 93 },
	{ config_id = 2156 , gadget_id = 73070044 , pos = { x = 6188.377, y = 216.3, z = 10061.66 } , rot = { x = 0, y = 314.019, z = 0 } , level = 93 },
	{ config_id = 2157 , gadget_id = 73070044 , pos = { x = 6188.037, y = 216.3, z = 10071.6 } , rot = { x = 0, y = 224.018, z = 0 } , level = 93 },
	{ config_id = 2158 , gadget_id = 73070044 , pos = { x = 6172.034, y = 216.3, z = 10044.75 } , rot = { x = 0, y = 314.019, z = 0 } , level = 93 },
	{ config_id = 2159 , gadget_id = 73070044 , pos = { x = 6176.103, y = 216.3, z = 10083.13 } , rot = { x = 0, y = 224.018, z = 0 } , level = 93 },
	{ config_id = 2160 , gadget_id = 73070044 , pos = { x = 6177.1, y = 216.3, z = 10050.01 } , rot = { x = 0, y = 314.019, z = 0 } , level = 93 },
	{ config_id = 2161 , gadget_id = 73070044 , pos = { x = 6179.848, y = 216.3, z = 10079.52 } , rot = { x = 0, y = 224.018, z = 0 } , level = 93 },
	{ config_id = 2162 , gadget_id = 73070044 , pos = { x = 6182.708, y = 216.3, z = 10055.8 } , rot = { x = 0, y = 314.019, z = 0 } , level = 93 },
	{ config_id = 2163 , gadget_id = 73070044 , pos = { x = 6183.716, y = 216.3, z = 10075.78 } , rot = { x = 0, y = 224.018, z = 0 } , level = 93 },
	{ config_id = 2166 , gadget_id = 73070043 , pos = { x = 6184.521, y = 216.5, z = 10059.79 } , rot = { x = 0, y = 317.683, z = 0 } , level = 93 },
	{ config_id = 2167 , gadget_id = 73070043 , pos = { x = 6176.378, y = 216.5, z = 10051.55 } , rot = { x = 0, y = 317.683, z = 0 } , level = 93 },
	{ config_id = 2186 , gadget_id = 73070044 , pos = { x = 6185.359, y = 216.3, z = 10060.17 } , rot = { x = 0, y = 284.281, z = 0 } , level = 93 },
	{ config_id = 2187 , gadget_id = 73070044 , pos = { x = 6189.082, y = 216.3, z = 10063.83 } , rot = { x = 0, y = 269.281, z = 0 } , level = 93 },
	{ config_id = 2188 , gadget_id = 73070044 , pos = { x = 6191.92, y = 216.3, z = 10069.27 } , rot = { x = 0, y = 254.281, z = 0 } , level = 93 },
	{ config_id = 2189 , gadget_id = 73070044 , pos = { x = 6187.796, y = 216.3, z = 10073.1 } , rot = { x = 0, y = 239.281, z = 0 } , level = 93 },
	{ config_id = 2190 , gadget_id = 73070044 , pos = { x = 6184.333, y = 216.3, z = 10076.44 } , rot = { x = 0, y = 224.281, z = 0 } , level = 93 },
	{ config_id = 2191 , gadget_id = 73070044 , pos = { x = 6181.12, y = 216.3, z = 10080.19 } , rot = { x = 0, y = 209.281, z = 0 } , level = 93 },
	{ config_id = 2192 , gadget_id = 73070044 , pos = { x = 6176.96, y = 216.3, z = 10083.79 } , rot = { x = 0, y = 194.281, z = 0 } , level = 93 },
	{ config_id = 2193 , gadget_id = 73070044 , pos = { x = 6171.58, y = 216.3, z = 10083.09 } , rot = { x = 0, y = 179.281, z = 0 } , level = 93 },
	{ config_id = 2194 , gadget_id = 73070044 , pos = { x = 6167.553, y = 216.3, z = 10078.79 } , rot = { x = 0, y = 164.281, z = 0 } , level = 93 },
	{ config_id = 2195 , gadget_id = 73070044 , pos = { x = 6164.572, y = 216.3, z = 10075.82 } , rot = { x = 0, y = 149.281, z = 0 } , level = 93 },
	{ config_id = 2196 , gadget_id = 73070044 , pos = { x = 6162.219, y = 216.3, z = 10072.98 } , rot = { x = 0, y = 134.281, z = 0 } , level = 93 },
	{ config_id = 2197 , gadget_id = 73070044 , pos = { x = 6159.464, y = 216.3, z = 10070.54 } , rot = { x = 0, y = 119.281, z = 0 } , level = 93 },
	{ config_id = 2198 , gadget_id = 73070042 , pos = { x = 6171.824, y = 216.3, z = 10063.61 } , rot = { x = 0, y = 284.281, z = 0 } , level = 93 },
	{ config_id = 2199 , gadget_id = 73070042 , pos = { x = 6171.824, y = 216.3, z = 10063.61 } , rot = { x = 0, y = 329.281, z = 0 } , level = 93 },
	{ config_id = 2200 , gadget_id = 73070043 , pos = { x = 6171.824, y = 216.5, z = 10063.61 } , rot = { x = 0, y = 284.281, z = 0 } , level = 93 },
	{ config_id = 2201 , gadget_id = 73070045 , pos = { x = 6171.824, y = 216.7, z = 10063.61 } , rot = { x = 0, y = 284.281, z = 0 } , level = 93 },
	{ config_id = 2205 , gadget_id = 73070050 , pos = { x = 6150.293, y = 216.3, z = 10060.04 } , rot = { x = 0, y = 44.046, z = 0 } , level = 93 },
	{ config_id = 2206 , gadget_id = 73070050 , pos = { x = 6174.023, y = 216.3, z = 10085.91 } , rot = { x = 0, y = 134.046, z = 0 } , level = 93 },
	{ config_id = 2207 , gadget_id = 73070050 , pos = { x = 6192.515, y = 216.3, z = 10067.73 } , rot = { x = 0, y = 224.045, z = 0 } , level = 93 },
	{ config_id = 2208 , gadget_id = 73070050 , pos = { x = 6168.351, y = 216.3, z = 10042.78 } , rot = { x = 0, y = 314.045, z = 0 } , level = 93 },
	{ config_id = 2211 , gadget_id = 73070048 , pos = { x = 6163.814, y = 216.252, z = 10068.79 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 2213 , gadget_id = 73070042 , pos = { x = 6186.896, y = 216.5, z = 10067.89 } , rot = { x = 0, y = 322.951, z = 0 } , level = 93 },
	{ config_id = 2214 , gadget_id = 73070042 , pos = { x = 6186.003, y = 216.5, z = 10064.5 } , rot = { x = 0.034, y = 314.509, z = 0.691 } , level = 93 },
	{ config_id = 2215 , gadget_id = 73070042 , pos = { x = 6184.607, y = 216.5, z = 10061.28 } , rot = { x = 359.767, y = 306.671, z = 358.037 } , level = 93 },
	{ config_id = 2216 , gadget_id = 73070042 , pos = { x = 6182.051, y = 216.5, z = 10058.27 } , rot = { x = 359.736, y = 306.151, z = 357.862 } , level = 93 },
	{ config_id = 2217 , gadget_id = 73070042 , pos = { x = 6177.797, y = 216.5, z = 10053.39 } , rot = { x = 359.935, y = 322.414, z = 3.378 } , level = 93 },
	{ config_id = 2218 , gadget_id = 73070042 , pos = { x = 6175.107, y = 216.5, z = 10051.07 } , rot = { x = 0, y = 320.671, z = 0 } , level = 93 },
	{ config_id = 2219 , gadget_id = 73070042 , pos = { x = 6172.119, y = 216.5, z = 10048.97 } , rot = { x = 0, y = 309.165, z = 0 } , level = 93 },
	{ config_id = 2220 , gadget_id = 73070042 , pos = { x = 6168.229, y = 216.5, z = 10048.46 } , rot = { x = 0, y = 303.618, z = 0 } , level = 93 },
	{ config_id = 2221 , gadget_id = 73070042 , pos = { x = 6172.962, y = 216.5, z = 10048.88 } , rot = { x = 0, y = 317.985, z = 0 } , level = 93 },
	{ config_id = 2222 , gadget_id = 73070042 , pos = { x = 6186.821, y = 216.5, z = 10063.48 } , rot = { x = 0, y = 308.157, z = 0 } , level = 93 },
	{ config_id = 2223 , gadget_id = 73070042 , pos = { x = 6186.003, y = 216.5, z = 10064.5 } , rot = { x = 0, y = 285.01, z = 0 } , level = 93 },
	{ config_id = 2224 , gadget_id = 73070042 , pos = { x = 6168.229, y = 216.5, z = 10048.46 } , rot = { x = 0, y = 357.327, z = 0 } , level = 93 },
	{ config_id = 2225 , gadget_id = 73070043 , pos = { x = 6175.107, y = 216.5, z = 10051.07 } , rot = { x = 0, y = 312.476, z = 0 } , level = 93 },
	{ config_id = 2226 , gadget_id = 73070043 , pos = { x = 6183.168, y = 216.5, z = 10059.44 } , rot = { x = 0, y = 307.815, z = 0 } , level = 93 },
	{ config_id = 2227 , gadget_id = 73070042 , pos = { x = 6179.875, y = 216.5, z = 10056.92 } , rot = { x = 0, y = 312.476, z = 0 } , level = 93 },
	{ config_id = 2228 , gadget_id = 73070042 , pos = { x = 6178.904, y = 216.5, z = 10055.44 } , rot = { x = 0, y = 312.476, z = 0 } , level = 93 },
	{ config_id = 2229 , gadget_id = 73070044 , pos = { x = 6156.656, y = 216.3, z = 10067.47 } , rot = { x = 0, y = 104.281, z = 0 } , level = 93 },
	{ config_id = 2230 , gadget_id = 73070044 , pos = { x = 6152.719, y = 216.3, z = 10063.37 } , rot = { x = 0, y = 89.281, z = 0 } , level = 93 },
	{ config_id = 2231 , gadget_id = 73070044 , pos = { x = 6152.029, y = 216.3, z = 10058.04 } , rot = { x = 0, y = 74.281, z = 0 } , level = 93 },
	{ config_id = 2232 , gadget_id = 73070044 , pos = { x = 6155.568, y = 216.3, z = 10053.95 } , rot = { x = 0, y = 59.281, z = 0 } , level = 93 },
	{ config_id = 2233 , gadget_id = 73070044 , pos = { x = 6159.108, y = 216.3, z = 10050.57 } , rot = { x = 0, y = 44.281, z = 0 } , level = 93 },
	{ config_id = 2234 , gadget_id = 73070044 , pos = { x = 6162.655, y = 216.3, z = 10047.26 } , rot = { x = 0, y = 29.281, z = 0 } , level = 93 },
	{ config_id = 2235 , gadget_id = 73070044 , pos = { x = 6166.716, y = 216.3, z = 10043.54 } , rot = { x = 0, y = 14.281, z = 0 } , level = 93 },
	{ config_id = 2236 , gadget_id = 73070044 , pos = { x = 6172.048, y = 216.3, z = 10045.74 } , rot = { x = 0, y = 359.281, z = 0 } , level = 93 },
	{ config_id = 2237 , gadget_id = 73070044 , pos = { x = 6175.726, y = 216.3, z = 10049.75 } , rot = { x = 0, y = 344.281, z = 0 } , level = 93 },
	{ config_id = 2238 , gadget_id = 73070044 , pos = { x = 6178.263, y = 216.3, z = 10052.77 } , rot = { x = 0, y = 329.281, z = 0 } , level = 93 },
	{ config_id = 2239 , gadget_id = 73070044 , pos = { x = 6180.505, y = 216.3, z = 10055.14 } , rot = { x = 0, y = 314.281, z = 0 } , level = 93 },
	{ config_id = 2240 , gadget_id = 73070044 , pos = { x = 6182.745, y = 216.3, z = 10057.49 } , rot = { x = 0, y = 299.281, z = 0 } , level = 93 },
	{ config_id = 2253 , gadget_id = 73070044 , pos = { x = 6187.367, y = 216.3, z = 10062.96 } , rot = { x = 0, y = 283.581, z = 0 } , level = 75 },
	{ config_id = 2254 , gadget_id = 73070044 , pos = { x = 6173.683, y = 216.3, z = 10048.62 } , rot = { x = 0, y = 342.553, z = 0 } , level = 75 },
	{ config_id = 2255 , gadget_id = 73070044 , pos = { x = 6179.836, y = 216.3, z = 10079.26 } , rot = { x = 0, y = 206.725, z = 0 } , level = 75 },
	{ config_id = 2256 , gadget_id = 73070044 , pos = { x = 6164.822, y = 216.3, z = 10047.38 } , rot = { x = 0, y = 17.882, z = 0 } , level = 75 },
	{ config_id = 2257 , gadget_id = 73070044 , pos = { x = 6191.367, y = 216.3, z = 10069.13 } , rot = { x = 0, y = 256.649, z = 0 } , level = 75 },
	{ config_id = 2258 , gadget_id = 73070044 , pos = { x = 6152.274, y = 216.6, z = 10082.68 } , rot = { x = 0, y = 313.962, z = 0 } , level = 93 },
	{ config_id = 2275 , gadget_id = 73070042 , pos = { x = 6189.224, y = 216.5, z = 10069.96 } , rot = { x = 0, y = 311.701, z = 0 } , level = 93 },
	{ config_id = 2276 , gadget_id = 73070042 , pos = { x = 6190.121, y = 216.5, z = 10065.88 } , rot = { x = 0.034, y = 314.509, z = 0.691 } , level = 93 },
	{ config_id = 2277 , gadget_id = 73070042 , pos = { x = 6169.801, y = 216.5, z = 10043.01 } , rot = { x = 0.201, y = 319.265, z = 358.034 } , level = 93 },
	{ config_id = 2278 , gadget_id = 73070042 , pos = { x = 6173.686, y = 216.5, z = 10048.17 } , rot = { x = 0.005, y = 313.3, z = 357.846 } , level = 93 },
	{ config_id = 2279 , gadget_id = 73070042 , pos = { x = 6175.626, y = 216.5, z = 10052.08 } , rot = { x = 0.203, y = 317.868, z = 3.373 } , level = 93 },
	{ config_id = 2280 , gadget_id = 73070042 , pos = { x = 6179.979, y = 216.5, z = 10058.15 } , rot = { x = 0, y = 312.293, z = 0 } , level = 93 },
	{ config_id = 2281 , gadget_id = 73070042 , pos = { x = 6178.024, y = 216.5, z = 10056.31 } , rot = { x = 0, y = 315.917, z = 0 } , level = 93 },
	{ config_id = 2282 , gadget_id = 73070042 , pos = { x = 6177.164, y = 216.5, z = 10054.54 } , rot = { x = 0, y = 316.702, z = 0 } , level = 93 },
	{ config_id = 2283 , gadget_id = 73070042 , pos = { x = 6170.927, y = 216.5, z = 10046.47 } , rot = { x = 0, y = 321.326, z = 0 } , level = 93 },
	{ config_id = 2284 , gadget_id = 73070042 , pos = { x = 6186.343, y = 216.5, z = 10061.18 } , rot = { x = 0, y = 307.697, z = 0 } , level = 93 },
	{ config_id = 2285 , gadget_id = 73070042 , pos = { x = 6188.653, y = 216.5, z = 10064.5 } , rot = { x = 0, y = 303.469, z = 0 } , level = 93 },
	{ config_id = 2286 , gadget_id = 73070042 , pos = { x = 6167.426, y = 216.5, z = 10047.85 } , rot = { x = 0, y = 357.327, z = 0 } , level = 93 },
	{ config_id = 2287 , gadget_id = 73070043 , pos = { x = 6188.425, y = 216.5, z = 10067.36 } , rot = { x = 0, y = 312.476, z = 0 } , level = 93 },
	{ config_id = 2288 , gadget_id = 73070043 , pos = { x = 6182.365, y = 216.5, z = 10058.83 } , rot = { x = 0, y = 307.815, z = 0 } , level = 93 },
	{ config_id = 2289 , gadget_id = 73070042 , pos = { x = 6169.769, y = 216.5, z = 10045.07 } , rot = { x = 0, y = 312.476, z = 0 } , level = 93 },
	{ config_id = 2290 , gadget_id = 73070042 , pos = { x = 6174.304, y = 216.5, z = 10050.46 } , rot = { x = 0, y = 312.476, z = 0 } , level = 93 },
	{ config_id = 2292 , gadget_id = 73070044 , pos = { x = 6180.385, y = 216.6, z = 10059.65 } , rot = { x = 0, y = 309.327, z = 0 } , level = 93 },
	{ config_id = 2293 , gadget_id = 73070044 , pos = { x = 6180.295, y = 216.6, z = 10058.43 } , rot = { x = 0, y = 310.868, z = 0 } , level = 93 },
	{ config_id = 2294 , gadget_id = 73070044 , pos = { x = 6179.799, y = 216.6, z = 10057.53 } , rot = { x = 0, y = 312.414, z = 0 } , level = 93 },
	{ config_id = 2295 , gadget_id = 73070044 , pos = { x = 6178.397, y = 216.6, z = 10056.08 } , rot = { x = 0, y = 315.51, z = 0 } , level = 93 },
	{ config_id = 2296 , gadget_id = 73070044 , pos = { x = 6177.519, y = 216.6, z = 10055.55 } , rot = { x = 0, y = 317.056, z = 0 } , level = 93 },
	{ config_id = 2297 , gadget_id = 73070044 , pos = { x = 6176.32, y = 216.6, z = 10055.41 } , rot = { x = 0, y = 318.597, z = 0 } , level = 93 },
	{ config_id = 2298 , gadget_id = 73070048 , pos = { x = 6185.261, y = 217.638, z = 10068.65 } , rot = { x = 0, y = 0, z = 0 } , level = 75 },
	{ config_id = 2299 , gadget_id = 73070048 , pos = { x = 6174.936, y = 217.6, z = 10054.97 } , rot = { x = 0, y = 0, z = 0 } , level = 75 },
	{ config_id = 2300 , gadget_id = 73070048 , pos = { x = 6161.059, y = 217.638, z = 10055.31 } , rot = { x = 0, y = 0, z = 0 } , level = 75 },
	{ config_id = 2301 , gadget_id = 73070048 , pos = { x = 6157.283, y = 217.6, z = 10065.88 } , rot = { x = 0, y = 0, z = 0 } , level = 75 },
	{ config_id = 2302 , gadget_id = 73070048 , pos = { x = 6170.505, y = 217.659, z = 10077.33 } , rot = { x = 0, y = 0, z = 0 } , level = 75 },
	{ config_id = 2303 , gadget_id = 73070048 , pos = { x = 6179.526, y = 217.605, z = 10075.92 } , rot = { x = 0, y = 0, z = 0 } , level = 75 },
	{ config_id = 2304 , gadget_id = 73070048 , pos = { x = 6166.809, y = 217.6, z = 10050.39 } , rot = { x = 0, y = 0, z = 0 } , level = 75 },
	{ config_id = 2305 , gadget_id = 73070048 , pos = { x = 6155.804, y = 217.639, z = 10061.43 } , rot = { x = 0, y = 0, z = 0 } , level = 75 },
	{ config_id = 2306 , gadget_id = 73070048 , pos = { x = 6164.873, y = 217.693, z = 10073.06 } , rot = { x = 0, y = 0, z = 0 } , level = 75 },
	{ config_id = 2307 , gadget_id = 73070048 , pos = { x = 6183.077, y = 217.655, z = 10063.08 } , rot = { x = 0, y = 0, z = 0 } , level = 75 },
	{ config_id = 2308 , gadget_id = 73070048 , pos = { x = 6169.718, y = 217.589, z = 10048.73 } , rot = { x = 0, y = 0, z = 0 } , level = 75 },
	{ config_id = 2309 , gadget_id = 73070044 , pos = { x = 6179.186, y = 216.6, z = 10056.72 } , rot = { x = 0, y = 313.964, z = 0 } , level = 93 },
	{ config_id = 2311 , gadget_id = 70801168 , pos = { x = 6148.194, y = 216.987, z = 10060.21 } , rot = { x = 0, y = 0, z = 0 } , level = 75 },
	{ config_id = 2312 , gadget_id = 70801168 , pos = { x = 6175.242, y = 216.775, z = 10088.51 } , rot = { x = 0, y = 0, z = 0 } , level = 75 },
	{ config_id = 2313 , gadget_id = 73054028 , pos = { x = 6172.066, y = 216.594, z = 10062.16 } , rot = { x = 0, y = 0, z = 0 } , level = 75 },
	{ config_id = 2314 , gadget_id = 73070045 , pos = { x = 6172.962, y = 216.7, z = 10048.88 } , rot = { x = 0, y = 358.629, z = 0 } , level = 93 },
	{ config_id = 2315 , gadget_id = 73070045 , pos = { x = 6186.821, y = 216.7, z = 10063.48 } , rot = { x = 0, y = 277.634, z = 0 } , level = 93 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = {  },
		gadgets = { 2005,2007,2008,2009,2010,2011,2012,2013,2014,2023,2024,2025,2026,2027,2028,2032,2033,2034,2035,2036,2037,2038,2039,2040,2041,2042,2043,2044,2048,2049,2050,2051,2052,2053,2054,2055,2056,2057,2058,2059,2060,2061,2062,2063,2064,2065,2067,2068,2069,2070,2071,2072,2073,2074,2075,2076,2077,2078,2079,2080,2081,2082,2083,2084,2085,2086,2087,2088,2089,2090,2091,2092,2095,2096,2099,2101,2102,2103,2104,2105,2106,2107,2108,2109,2110,2111,2114,2115,2116,2117,2118,2119,2120,2121,2122,2123,2124,2125,2126,2127,2128,2129,2130,2131,2132,2133,2134,2135,2136,2137,2138,2154,2155,2156,2157,2158,2159,2160,2161,2162,2163,2166,2167,2186,2187,2188,2189,2190,2191,2192,2193,2194,2195,2196,2197,2198,2199,2200,2201,2205,2206,2207,2208,2211,2213,2214,2215,2216,2217,2218,2219,2220,2221,2222,2223,2224,2225,2226,2227,2228,2229,2230,2231,2232,2233,2234,2235,2236,2237,2238,2239,2240,2253,2254,2255,2256,2257,2258,2275,2276,2277,2278,2279,2280,2281,2282,2283,2284,2285,2286,2287,2288,2289,2290,2292,2293,2294,2295,2296,2297,2298,2299,2300,2301,2302,2303,2304,2305,2306,2307,2308,2309,2311,2312,2313,2314,2315 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
