-- 地图配置
scene_config = {
	begin_pos = { x = 0.0, z = 0.0 },
	size = { x = 1024.0, z = 1024.0 },

	born_pos = { x = 500.023, y = 69.849, z = 515.773 },
	born_rot = { x = 0.000, y = 180.000, z = 0.000 },

	born_point_list = {
		{ pos = { x = 500.023, y = 69.849, z = 515.773 }, rot = { x = 0.000, y = 180.000, z = 0.000 } },
		{ pos = { x = 502.023, y = 69.849, z = 517.773 }, rot = { x = 0.000, y = 180.000, z = 0.000 } },
		{ pos = { x = 498.023, y = 69.849, z = 517.773 }, rot = { x = 0.000, y = 180.000, z = 0.000 } },
		{ pos = { x = 500.023, y = 69.849, z = 519.773 }, rot = { x = 0.000, y = 180.000, z = 0.000 } }
	},

	reborn_point_list = {
		{ pos = { x = 500.023, y = 69.849, z = 506.203 }, rot = { x = 0.000, y = 180.000, z = 0.000 } },
		{ pos = { x = 502.023, y = 69.849, z = 508.203 }, rot = { x = 0.000, y = 180.000, z = 0.000 } },
		{ pos = { x = 498.023, y = 69.849, z = 508.203 }, rot = { x = 0.000, y = 180.000, z = 0.000 } },
		{ pos = { x = 500.023, y = 69.849, z = 510.203 }, rot = { x = 0.000, y = 180.000, z = 0.000 } }
	},

	die_y = -20,
	city_id = 6,
	vision_anchor = { x = 0.0, z = 0.0 }
}

-- 所有的区块
blocks = { 40795 }

-- 所有的区块范围坐标
block_rects = {
	{ min = { x = 0.0, z = 0.0 }, max = { x = 1024.0, z = 1024.0 } }
}

-- Dummy Points
dummy_points = { }

-- Routes
routes_config = { }