-- 地图配置
scene_config = {
    begin_pos = { x = -2048.0, z = -2048.0 },
    size = { x = 3072.0, z = 3072.0 },
    born_pos = { x = 772.0, y = 858.0, z = 39.0 },
    born_rot = { x = 0.0, y = 270.0, z = 0.0 },
    die_y = -1000,
    vision_anchor = { x = -3000.0, z = -3000.0 }
}

-- 所有的区块
blocks = {
    910101,
    910102,
    910103,
    910104,
    910199
}

-- 所有的区块范围坐标
block_rects = {
    -- Block 910101
    { min = { x = 0.0, z = 0.0 }, max = { x = 1024.0, z = 1024.0 } },
    
    -- Block 910102
    { min = { x = 0.0, z = -1024.0 }, max = { x = 1024.0, z = 0.0 } },
    
    -- Block 910103
    { min = { x = -1024.0, z = 0.0 }, max = { x = 0.0, z = 1024.0 } },
    
    -- Block 910104
    { min = { x = -1024.0, z = -1024.0 }, max = { x = 0.0, z = 0.0 } },
    
    -- Block 910199
    { min = { x = -1024.0, z = -1024.0 }, max = { x = 0.0, z = 0.0 } }
}

