-- 基础信息
local base_info = {
	group_id = 220322009
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {

}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 9002 , gadget_id = 70900201 , pos = { x = 301.219, y = 310.175, z = 682.943 } , rot = { x = 0, y = 0, z = 0 } , level = 92 },
	{ config_id = 9003 , gadget_id = 70900201 , pos = { x = 230.323, y = 311.468, z = 661.85 } , rot = { x = 0, y = 0, z = 0 } , level = 92 },
	{ config_id = 9004 , gadget_id = 70900201 , pos = { x = 211.05, y = 311.983, z = 653.899 } , rot = { x = 0, y = 0, z = 0 } , level = 92 },
	{ config_id = 9006 , gadget_id = 70900201 , pos = { x = 264.274, y = 312.567, z = 584.329 } , rot = { x = 0, y = 0, z = 0 } , level = 92 },
	{ config_id = 9007 , gadget_id = 70900201 , pos = { x = 307.016, y = 312.479, z = 541.376 } , rot = { x = 0, y = 0, z = 0 } , level = 92 },
	{ config_id = 9008 , gadget_id = 70900201 , pos = { x = 293.851, y = 316.121, z = 575.996 } , rot = { x = 0, y = 0, z = 0 } , level = 92 },
	{ config_id = 9009 , gadget_id = 70900201 , pos = { x = 307.315, y = 325.403, z = 543.123 } , rot = { x = 0, y = 0, z = 0 } , level = 92 },
	{ config_id = 9010 , gadget_id = 70900203 , pos = { x = 298.277, y = 314.045, z = 450.268 } , rot = { x = 0, y = 0, z = 0 } , level = 92 },
	{ config_id = 9011 , gadget_id = 70900201 , pos = { x = 297.96, y = 309.605, z = 371.17 } , rot = { x = 0, y = 0, z = 0 } , level = 92 },
	{ config_id = 9012 , gadget_id = 70900201 , pos = { x = 312.542, y = 315.627, z = 340.776 } , rot = { x = 0, y = 0, z = 0 } , level = 92 },
	{ config_id = 9013 , gadget_id = 70900201 , pos = { x = 335.615, y = 317.266, z = 314.22 } , rot = { x = 0, y = 0, z = 0 } , level = 92 },
	{ config_id = 9014 , gadget_id = 70900201 , pos = { x = 335.49, y = 291.616, z = 239.107 } , rot = { x = 0, y = 0, z = 0 } , level = 92 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = {  },
		gadgets = { 9002,9003,9004,9006,9007,9008,9009,9010,9011,9012,9013,9014 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
