-- 基础信息
local base_info = {
	group_id = 220322006
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 6001 , monster_id = 26300401 , pos = { x = 303.454, y = 305.581, z = 431.509 } , rot = { x = 0, y = 295.622, z = 0 } , level = 92 , title_id = 8136, special_name_id = 2814101 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 6003 , gadget_id = 70294075 , pos = { x = 298.061, y = 311.835, z = 373.576 } , rot = { x = 0, y = 0, z = 0 } , level = 92 },
	{ config_id = 6005 , gadget_id = 70211021 , pos = { x = 297.393, y = 308.32, z = 369.427 } , rot = { x = 0, y = 2.521, z = 0 } , level = 92 },
	{ config_id = 6006 , gadget_id = 73074062 , pos = { x = 298.1, y = 313.434, z = 452.418 } , rot = { x = 0, y = 0, z = 0 } , level = 92 },
	{ config_id = 6007 , gadget_id = 73074062 , pos = { x = 314.966, y = 308.075, z = 422.168 } , rot = { x = 0, y = 0, z = 0 } , level = 92 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 6001 },
		gadgets = { 6003,6005,6006,6007 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
