-- 基础信息
local base_info = {
	group_id = 220322002
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 2001 , monster_id = 29130101 , pos = { x = 335.417, y = 288.82, z = 238.534 } , rot = { x = 0, y = 0, z = 0 } , level = 92 , title_id = 215, special_name_id = 2022101 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {

}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 2001 },
		gadgets = {  },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
