-- 基础信息
local base_info = {
	group_id = 220322003
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 3002 , monster_id = 26050901 , pos = { x = 237.586, y = 310.819, z = 611.994 } , rot = { x = 0, y = 339.114, z = 0 } , level = 92 , title_id = 8004, special_name_id = 2800401 },
	{ config_id = 3022 , monster_id = 26050901 , pos = { x = 211.647, y = 310.679, z = 600.829 } , rot = { x = 0, y = 29.224, z = 0 } , level = 92 , title_id = 8004, special_name_id = 2800401 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 3003 , gadget_id = 70320161 , pos = { x = 231.188, y = 310.8, z = 623.048 } , rot = { x = 83.858, y = 0.001, z = 32.321 } , level = 92 },
	{ config_id = 3010 , gadget_id = 73112035 , pos = { x = 230.411, y = 320.754, z = 635.115 } , rot = { x = 0, y = 0, z = 0 } , level = 92 },
	{ config_id = 3011 , gadget_id = 73112079 , pos = { x = 250.187, y = 314.571, z = 595.254 } , rot = { x = 0, y = 315.499, z = 0 } , level = 92 },
	{ config_id = 3015 , gadget_id = 70294075 , pos = { x = 263.551, y = 313.596, z = 584.821 } , rot = { x = 0, y = 315.6, z = 0 } , level = 92 },
	{ config_id = 3017 , gadget_id = 70320155 , pos = { x = 264.11, y = 310.651, z = 589.069 } , rot = { x = 0, y = 259.821, z = 0 } , level = 92 },
	{ config_id = 3020 , gadget_id = 73112031 , pos = { x = 233.748, y = 310.728, z = 626.801 } , rot = { x = 0, y = 0, z = 0 } , level = 92 },
	{ config_id = 3021 , gadget_id = 73112031 , pos = { x = 236.349, y = 310.728, z = 614.224 } , rot = { x = 0, y = 0, z = 0 } , level = 92 },
	{ config_id = 3023 , gadget_id = 73112031 , pos = { x = 211.647, y = 310.679, z = 600.829 } , rot = { x = 0, y = 0, z = 0 } , level = 92 },
	{ config_id = 3027 , gadget_id = 73112027 , pos = { x = 232.879, y = 310.728, z = 622.89 } , rot = { x = 0, y = 0, z = 0 } , level = 92 },
	{ config_id = 3028 , gadget_id = 73112028 , pos = { x = 232.179, y = 311.235, z = 623.88 } , rot = { x = 0, y = 0, z = 0 } , level = 92 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 3002,3022 },
		gadgets = { 3003,3010,3011,3015,3017,3020,3021,3023,3027,3028 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
