-- 基础信息
local base_info = {
	group_id = 220322005
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 5001 , monster_id = 22130002 , pos = { x = 301.707, y = 311.984, z = 472.918 } , rot = { x = 0, y = 271.421, z = 0 } , level = 92 , title_id = 4087, special_name_id = 2408701 },
	{ config_id = 5002 , monster_id = 22130101 , pos = { x = 294.42, y = 311.952, z = 478.577 } , rot = { x = 0, y = 0, z = 0 } , level = 92 , title_id = 4087, special_name_id = 2408701 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 5003 , gadget_id = 73112033 , pos = { x = 306.96, y = 314.537, z = 470.81 } , rot = { x = 0, y = 0, z = 315 } , level = 92 },
	{ config_id = 5004 , gadget_id = 73112033 , pos = { x = 289.29, y = 314.45, z = 480.702 } , rot = { x = 0, y = 180, z = 315 } , level = 92 },
	{ config_id = 5005 , gadget_id = 73112036 , pos = { x = 297.91, y = 315.504, z = 445.994 } , rot = { x = 336.632, y = 0, z = 0 } , level = 92 },
	{ config_id = 5007 , gadget_id = 73112031 , pos = { x = 300.188, y = 311.419, z = 444.522 } , rot = { x = 0, y = 0, z = 0 } , level = 92 },
	{ config_id = 5009 , gadget_id = 73112031 , pos = { x = 294.081, y = 311.791, z = 479.746 } , rot = { x = 0, y = 0, z = 0 } , level = 92 },
	{ config_id = 5010 , gadget_id = 73112031 , pos = { x = 305.689, y = 315.02, z = 473.289 } , rot = { x = 0, y = 0, z = 0 } , level = 92 },
	{ config_id = 5011 , gadget_id = 73112036 , pos = { x = 288.929, y = 316.073, z = 447.311 } , rot = { x = 337.716, y = 18.484, z = 352.776 } , level = 92 },
	{ config_id = 5012 , gadget_id = 73112036 , pos = { x = 307.338, y = 316.077, z = 447.321 } , rot = { x = 337.8, y = 340.819, z = 7.488 } , level = 92 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 5001,5002 },
		gadgets = { 5003,5004,5005,5007,5009,5010,5011,5012 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
