-- 基础信息
local base_info = {
	group_id = 220322004
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 4012 , monster_id = 22130002 , pos = { x = 285.98, y = 310.923, z = 563.027 } , rot = { x = 0, y = 333.653, z = 0 } , level = 92 , title_id = 4087, special_name_id = 2408701 },
	{ config_id = 4021 , monster_id = 22130104 , pos = { x = 288.223, y = 310.92, z = 563.687 } , rot = { x = 0, y = 310.061, z = 0 } , level = 92 , title_id = 4087, special_name_id = 2408701 },
	{ config_id = 4022 , monster_id = 22130103 , pos = { x = 284.767, y = 310.92, z = 559.831 } , rot = { x = 0, y = 324.029, z = 0 } , level = 92 , title_id = 4087, special_name_id = 2408701 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 4002 , gadget_id = 73112037 , pos = { x = 272.384, y = 312.78, z = 556.075 } , rot = { x = 0, y = 0, z = 0 } , level = 92 },
	{ config_id = 4003 , gadget_id = 73112034 , pos = { x = 278.21, y = 315.574, z = 561.762 } , rot = { x = 0, y = 45.444, z = 0 } , level = 92 },
	{ config_id = 4005 , gadget_id = 73112031 , pos = { x = 285.799, y = 309.446, z = 563.907 } , rot = { x = 0, y = 0, z = 0 } , level = 92 },
	{ config_id = 4006 , gadget_id = 73112031 , pos = { x = 279.48, y = 314.57, z = 561.753 } , rot = { x = 0, y = 0, z = 0 } , level = 92 },
	{ config_id = 4007 , gadget_id = 73112031 , pos = { x = 279.48, y = 314.57, z = 561.753 } , rot = { x = 0, y = 0, z = 0 } , level = 92 },
	{ config_id = 4013 , gadget_id = 73112031 , pos = { x = 310.674, y = 325.955, z = 564.203 } , rot = { x = 0, y = 0, z = 0 } , level = 92 },
	{ config_id = 4015 , gadget_id = 70800111 , pos = { x = 274.912, y = 313.03, z = 564.833 } , rot = { x = 0, y = 333.437, z = 0 } , level = 92 },
	{ config_id = 4016 , gadget_id = 70800111 , pos = { x = 274.912, y = 316.973, z = 564.833 } , rot = { x = 0, y = 333.437, z = 0 } , level = 92 },
	{ config_id = 4017 , gadget_id = 70800111 , pos = { x = 279.384, y = 313.03, z = 567.069 } , rot = { x = 0, y = 333.437, z = 0 } , level = 92 },
	{ config_id = 4018 , gadget_id = 70800111 , pos = { x = 279.384, y = 316.973, z = 567.069 } , rot = { x = 0, y = 333.437, z = 0 } , level = 92 },
	{ config_id = 4019 , gadget_id = 70800111 , pos = { x = 283.856, y = 313.03, z = 569.305 } , rot = { x = 0, y = 333.437, z = 0 } , level = 92 },
	{ config_id = 4020 , gadget_id = 70800111 , pos = { x = 283.856, y = 316.973, z = 569.305 } , rot = { x = 0, y = 333.437, z = 0 } , level = 92 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 4012,4021,4022 },
		gadgets = { 4002,4003,4005,4006,4007,4013,4015,4016,4017,4018,4019,4020 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
