-- 基础信息
local base_info = {
	group_id = 201204005
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {

}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 5001 , gadget_id = 73080034 , pos = { x = -8.339, y = 1.923, z = 2.166 } , rot = { x = 0, y = 0, z = 0 } , level = 75 },
	{ config_id = 5002 , gadget_id = 73080030 , pos = { x = -8.536, y = 2.652, z = 4.028 } , rot = { x = 0, y = 90.881, z = 0 } , level = 75 },
	{ config_id = 5003 , gadget_id = 73080044 , pos = { x = -8.434, y = 1.911, z = 3.99 } , rot = { x = 0, y = 0, z = 0 } , level = 75 },
	{ config_id = 5004 , gadget_id = 73080045 , pos = { x = -9.075, y = 2.647, z = 3.557 } , rot = { x = 0, y = 153.666, z = 0 } , level = 75 },
	{ config_id = 5005 , gadget_id = 73080045 , pos = { x = -8.937, y = 2.644, z = 4.802 } , rot = { x = 0, y = 230.536, z = 0 } , level = 75 },
	{ config_id = 5006 , gadget_id = 73080046 , pos = { x = -9.011, y = 2.644, z = 4.488 } , rot = { x = 0, y = 42.58, z = 0 } , level = 75 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = {  },
		gadgets = { 5001,5002,5003,5004,5005,5006 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
