-- 基础信息
local base_info = {
	group_id = 220321007
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {

}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 7001 , gadget_id = 74030006 , pos = { x = 4508, y = 199.91, z = 9693 } , rot = { x = 0, y = 0, z = 0 } , level = 92 },
	{ config_id = 7002 , gadget_id = 74030001 , pos = { x = 4508, y = 581, z = 9693 } , rot = { x = 0, y = 0, z = 0 } , level = 92 },
	{ config_id = 7003 , gadget_id = 74030001 , pos = { x = 4508, y = 300, z = 9693 } , rot = { x = 0, y = 0, z = 0 } , level = 92 },
	{ config_id = 7004 , gadget_id = 74030001 , pos = { x = 4508, y = 400, z = 9693 } , rot = { x = 0, y = 0, z = 0 } , level = 92 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = {  },
		gadgets = { 7001,7002,7003,7004 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
