-- 基础信息
local base_info = {
	group_id = 220321011
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 11001 , monster_id = 20080201 , pos = { x = 5461.719, y = 200.779, z = 9397.138 } , rot = { x = 0, y = 229.034, z = 0 } , level = 92 , title_id = 2233, special_name_id = 2223401 },
	{ config_id = 11002 , monster_id = 26300401 , pos = { x = 5461.754, y = 200.82, z = 9397.688 } , rot = { x = 0, y = 228.542, z = 0 } , level = 92 , title_id = 8136, special_name_id = 2814101 },
	{ config_id = 11003 , monster_id = 33010301 , pos = { x = 5466.824, y = 200.348, z = 9385.584 } , rot = { x = 0, y = 351.376, z = 0 } , level = 92 , title_id = 5121, special_name_id = 2500130 },
	{ config_id = 11006 , monster_id = 26300101 , pos = { x = 5462.284, y = 200.776, z = 9397.824 } , rot = { x = 0, y = 231.322, z = 0 } , level = 92 , title_id = 8136, special_name_id = 2813601 },
	{ config_id = 11008 , monster_id = 33010601 , pos = { x = 5461.872, y = 201.335, z = 9408.854 } , rot = { x = 0, y = 175.051, z = 0 } , level = 92 , title_id = 5102, special_name_id = 2500101 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 11007 , gadget_id = 70270004 , pos = { x = 5457.761, y = 199.556, z = 9395.287 } , rot = { x = 0, y = 0, z = 0 } , level = 92 },
	{ config_id = 11010 , gadget_id = 70350246 , pos = { x = 5455.803, y = 203.004, z = 9405.528 } , rot = { x = 0, y = 8.601, z = 0 } , level = 92 },
	{ config_id = 11011 , gadget_id = 70350246 , pos = { x = 5450.515, y = 204.992, z = 9403.988 } , rot = { x = 0, y = 8.601, z = 0 } , level = 92 },
	{ config_id = 11012 , gadget_id = 70350246 , pos = { x = 5444.328, y = 204.428, z = 9400.509 } , rot = { x = 0, y = 325.783, z = 0 } , level = 92 },
	{ config_id = 11013 , gadget_id = 70350246 , pos = { x = 5442.445, y = 202.219, z = 9393.433 } , rot = { x = 0, y = 325.783, z = 0 } , level = 92 },
	{ config_id = 11014 , gadget_id = 70350246 , pos = { x = 5471.513, y = 200.484, z = 9389.206 } , rot = { x = 0, y = 97.6, z = 0 } , level = 92 },
	{ config_id = 11015 , gadget_id = 70350246 , pos = { x = 5472.905, y = 200.495, z = 9399.817 } , rot = { x = 0, y = 97.6, z = 0 } , level = 92 },
	{ config_id = 11016 , gadget_id = 70350246 , pos = { x = 5468.742, y = 200.661, z = 9406.858 } , rot = { x = 0, y = 54.782, z = 0 } , level = 92 },
	{ config_id = 11017 , gadget_id = 70350246 , pos = { x = 5459.349, y = 201.97, z = 9406.917 } , rot = { x = 0, y = 54.782, z = 0 } , level = 92 },
	{ config_id = 11023 , gadget_id = 73061002 , pos = { x = 5457.761, y = 199.556, z = 9395.287 } , rot = { x = 0, y = 0, z = 0 } , level = 92 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 11001,11002,11003,11006,11008 },
		gadgets = { 11007,11010,11011,11012,11013,11014,11015,11016,11017,11023 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
