-- 基础信息
local base_info = {
	group_id = 220321065
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {

}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 65005 , gadget_id = 73065004 , pos = { x = 1795.139, y = 218.646, z = 9520.126 } , rot = { x = 0, y = 0, z = 0 } , level = 106 },
	{ config_id = 65006 , gadget_id = 73065004 , pos = { x = 1795.675, y = 217.778, z = 9519.25 } , rot = { x = 0, y = 0, z = 0 } , level = 106 },
	{ config_id = 65014 , gadget_id = 73065004 , pos = { x = 1831.844, y = 211.138, z = 9543.048 } , rot = { x = 0, y = 0, z = 0 } , level = 106 },
	{ config_id = 65015 , gadget_id = 73065004 , pos = { x = 1831.82, y = 211.073, z = 9564.506 } , rot = { x = 0, y = 0, z = 0 } , level = 106 },
	{ config_id = 65016 , gadget_id = 73065004 , pos = { x = 1832.994, y = 211.566, z = 9564.88 } , rot = { x = 0, y = 0, z = 0 } , level = 106 },
	{ config_id = 65017 , gadget_id = 73065004 , pos = { x = 1834.599, y = 210.645, z = 9563.51 } , rot = { x = 0, y = 0, z = 0 } , level = 106 },
	{ config_id = 65021 , gadget_id = 73065004 , pos = { x = 1847.499, y = 210.707, z = 9544.805 } , rot = { x = 0, y = 0, z = 0 } , level = 106 },
	{ config_id = 65022 , gadget_id = 73065004 , pos = { x = 1848.744, y = 209.937, z = 9544.828 } , rot = { x = 0, y = 0, z = 0 } , level = 106 },
	{ config_id = 65023 , gadget_id = 73065004 , pos = { x = 1854.874, y = 210.648, z = 9542.689 } , rot = { x = 0, y = 0, z = 0 } , level = 106 },
	{ config_id = 65024 , gadget_id = 73065004 , pos = { x = 1842.548, y = 211.085, z = 9562.591 } , rot = { x = 0, y = 0, z = 0 } , level = 106 },
	{ config_id = 65030 , gadget_id = 73065004 , pos = { x = 1825.675, y = 212.57, z = 9532.923 } , rot = { x = 0, y = 0, z = 0 } , level = 106 },
	{ config_id = 65031 , gadget_id = 73065004 , pos = { x = 1793.124, y = 218.273, z = 9506.022 } , rot = { x = 0, y = 0, z = 0 } , level = 106 },
	{ config_id = 65056 , gadget_id = 73065004 , pos = { x = 1833.412, y = 212.796, z = 9541.868 } , rot = { x = 0, y = 0, z = 0 } , level = 106 },
	{ config_id = 65064 , gadget_id = 73065004 , pos = { x = 1871.27, y = 219.139, z = 9522.915 } , rot = { x = 0, y = 0, z = 0 } , level = 106 },
	{ config_id = 65081 , gadget_id = 73065004 , pos = { x = 1796.723, y = 218.978, z = 9519.951 } , rot = { x = 0, y = 0, z = 0 } , level = 106 },
	{ config_id = 65083 , gadget_id = 73065004 , pos = { x = 1831.94, y = 208.593, z = 9548.52 } , rot = { x = 0, y = 0, z = 0 } , level = 106 },
	{ config_id = 65084 , gadget_id = 73065004 , pos = { x = 1834.048, y = 208.412, z = 9549.244 } , rot = { x = 0, y = 0, z = 0 } , level = 106 },
	{ config_id = 65085 , gadget_id = 73065004 , pos = { x = 1831.171, y = 208.449, z = 9550.296 } , rot = { x = 0, y = 0, z = 0 } , level = 106 },
	{ config_id = 65086 , gadget_id = 73065004 , pos = { x = 1825.6, y = 208.333, z = 9554.93 } , rot = { x = 0, y = 0, z = 0 } , level = 106 },
	{ config_id = 65087 , gadget_id = 73065004 , pos = { x = 1835.66, y = 208.588, z = 9558.026 } , rot = { x = 0, y = 0, z = 0 } , level = 106 },
	{ config_id = 65088 , gadget_id = 73065004 , pos = { x = 1833.31, y = 215.603, z = 9568.46 } , rot = { x = 0, y = 0, z = 0 } , level = 106 },
	{ config_id = 65093 , gadget_id = 73065004 , pos = { x = 1821.05, y = 213.668, z = 9563.25 } , rot = { x = 0, y = 0, z = 0 } , level = 106 },
	{ config_id = 65094 , gadget_id = 73065004 , pos = { x = 1834.306, y = 215.199, z = 9564.608 } , rot = { x = 0, y = 0, z = 0 } , level = 106 },
	{ config_id = 65095 , gadget_id = 73065004 , pos = { x = 1833.108, y = 215.91, z = 9567.254 } , rot = { x = 0, y = 0, z = 0 } , level = 106 },
	{ config_id = 65096 , gadget_id = 73065004 , pos = { x = 1833.942, y = 214.832, z = 9568.192 } , rot = { x = 0, y = 0, z = 0 } , level = 106 },
	{ config_id = 65097 , gadget_id = 73065004 , pos = { x = 1830.788, y = 214.203, z = 9575.054 } , rot = { x = 0, y = 0, z = 0 } , level = 106 },
	{ config_id = 65212 , gadget_id = 73065004 , pos = { x = 1837.647, y = 216.886, z = 9566.248 } , rot = { x = 0, y = 0, z = 0 } , level = 106 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = {  },
		gadgets = { 65005,65006,65014,65015,65016,65017,65021,65022,65023,65024,65030,65031,65056,65064,65081,65083,65084,65085,65086,65087,65088,65093,65094,65095,65096,65097,65212 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
